Repository: stecyr/pgrouting
Catalog: doc/i18n/*/LC_MESSAGES/doc/src/introduction/support.po
Languages: fr

source: pgRouting community support is available through `website <http://www.pgrouting.org>`_, `documentation <http://docs.pgrouting.org>`_, tutorials, mailing lists and others. If you’re looking for :ref:`commercial support <support_commercial>`, find below a list of companies providing pgRouting development and consulting services.
fr: Le support de la communauté pgRouting est disponible depuis le `site web <http://www.pgrouting.org>`_, `documentation <http://docs.pgrouting.org>`_, tutoriels, listes emails et autres. Si vous cherchez un :ref:`support commercial <support_commercial>`, vous trouverez ci-dessous une liste des sociétés fournissant des services de développement et de conseil.

source: Reporting Problems
fr: Reporter un problème

source: Bugs are reported and managed in an `issue tracker <https://github.com/pgrouting/pgrouting/issues>`_. Please follow these steps:
fr: Les bugs sont reportés et gérés dans un `système de gestion d'incidents <https://github.com/pgrouting/pgrouting/issues>`_. Merci de suivre ces étapes :

source: Search the tickets to see if your problem has already been reported. If so, add any extra context you might have found, or at least indicate that you too are having the problem. This will help us prioritize common issues.
fr: Cherchez les tickets pour voir si votre problème a déjà été reporté. Si oui, ajoutez tout contexte supplémentaire que vous pourriez avoir trouvé, ou vous pouvez simplement ajouter que vous avez également le même problème. Cela nous aidera à établir la priorité des incidents en commun.

source: If your problem is unreported, create a `new issue <https://github.com/pgRouting/pgrouting/issues/new>`_ for it.
fr: Si votre problème n'est pas reporté, créer un `nouvel incident <https://github.com/pgRouting/pgrouting/issues/new>`_ pour ça.

source: In your report include explicit instructions to replicate your issue. The best tickets include the exact SQL necessary to replicate a problem.
fr: Dans votre rapport, incluez explicitement les instructions pour reproduire votre problème. Les meilleurs tickets incluent le SQL exact nécessaire pour reproduire un problème.

source: If you can test older versions of PostGIS for your problem, please do. On your ticket, note the earliest version the problem appears.
fr: Si vous pouvez tester les versions anciennes de PostGIS pour votre problème, merci de le faire. Dans votre ticket, mentionnez la plus récente version où le problème apparaît.

source: For the versions where you can replicate the problem, note the operating system and version of pgRouting, PostGIS and PostgreSQL.
fr: Pour les versions où vous pouvez reproduire le problème, notez le système d'exploitation et la version de pgRouting, PostGIS et PostgreSQL.

source: Mailing List and GIS StackExchange
fr: Liste d'emails et StackExchange SIG

source: There are two mailing lists for pgRouting hosted on OSGeo mailing list server:
fr: Il y a deux listes emails pour pgRouting hébergé sur le serveur de mailing list OSGeo.

source: User mailing list: http://lists.osgeo.org/mailman/listinfo/pgrouting-users
fr: Listes d'emails utilisateurs : http://lists.osgeo.org/mailman/listinfo/pgrouting-users

source: Developer mailing list: http://lists.osgeo.org/mailman/listinfo/pgrouting-dev
fr: Liste des emails développeurs : http://lists.osgeo.org/mailman/listinfo/pgrouting-dev

source: For general questions and topics about how to use pgRouting, please write to the user mailing list.
fr: Pour les questions générales et les sujets sur comment utiliser pgRouting, veuillez écrire à la liste des emails utilisateurs.

source: You can also ask at `GIS StackExchange <http://gis.stackexchange.com/>`_ and tag the question with ``pgrouting``. Find all questions tagged with ``pgrouting`` under http://gis.stackexchange.com/questions/tagged/pgrouting or subscribe to the `pgRouting questions feed <http://gis.stackexchange.com/feeds/tag?tagnames=pgrouting&sort=newest>`_.
fr: Vous pouvez aussi demander à `GIS StackExchange <http://gis.stackexchange.com/>`_ et étiquetter la question avec ``pgrouting``. Trouvez toutes les questions étiquetées avec ``pgrouting`` ici http://gis.stackexchange.com/questions/tagged/pgrouting ou abonnez-vous à `pgRouting questions feed <http://gis.stackexchange.com/feeds/tag?tagnames=pgrouting&sort=newest>`_.

source: Commercial Support
fr: Support Commercial

source: For users who require professional support, development and consulting services, consider contacting any of the following organizations, which have significantly contributed to the development of pgRouting:
fr: Pour les utilisateurs qui demandent un support professionnel et des services de conseil, veuillez contacter l'une des organisations suivantes, qui ont contribué de façon significative au développement de pgRouting :

source: **Company**
fr: **Société**

source: **Offices in**
fr: **Bureaux à**

source: **Website**
fr: **Site web**

source: Germany, Japan
fr: Allemagne, Japon

source: United States
fr: États-Unis

source: Japan
fr: Japon

source: Switzerland, France
fr: Suisse, France
