Repository: stecyr/pgrouting
Catalog: doc/i18n/*/LC_MESSAGES/doc/src/developer/index.po
Languages: es, fr

source: Developer's Guide
es: Guía del desarrollador
fr: Guide du développeur

source: All documentation should be in reStructuredText format. See: <http://docutils.sf.net/rst.html> for introductory docs.
es: Toda la documentación debe estar en formato reStructuredText. Ver http://docutils.sf.net/rst.html para documentaciones introductorias.
fr: Toute la documentation devrait être dans le format reStructuredText. Voir : <http://docutils.sf.net/rst.html> pour les docs d'introduction.

source: Source Tree Layout
es: Diseño del árbol de la fuente
fr: Disposition de l'Arbre des sources

source: cmake scripts used as part of our build system.
es: CMake scripts usados como parte de nuestro sistema de construcción.
fr: Scripts cmake utilisés en partie pour notre système de build.

source: core/
es: src/

source: This is the algorithm source tree. Each algorithm should be contained in its on sub-tree with doc, sql, src, and test sub-directories. This might get renamed to "algorithms" at some point.
es: Este es el árbol de código fuente de los algoritmos. Cada algoritmo debe estar contenido en su subárbol en con subdirectorios doc, sql, src y test. Esto puede ser renombrado a "algorithms" en algún momento.

source: core/astar/
es: src/astar/

source: This is an implementation of A* Search based on using Boost Graph libraries for its implementation. This is a Dijkstra shortest path implementation with a Euclidean Heuristic.
es: Esto es una implementación de la búsqueda A\* basada en el uso de las bibliotecas de gráficas Boost para su implementación. Esto es una implementación de ruta más corta de Dijkstra con una heurística euclidiana.
fr: Ceci est une implémentation de la Recherche A* basée sur l'utilisation de la bibliothèque Boost Graph. Ceci est une implémentation du plus court chemin Dijkstra avec une Heuristique Euclidienne.

source: core/common/
es: src/common/

source: At the moment this does not have an core in "src", but does have a lot of SQL wrapper code and topology code in the "sql" directory. *Algorithm specific wrappers should get move to the algorithm tree and appropriate tests should get added to validate the wrappers.*
es: Por el momento esto no tiene un núcleo en "src", pero tiene varios códigos de contenedores de SQL y código de topología en el directorio "sql". *Algoritmos de Contenedores específicos serán movidos al árbol de algoritmos y se deben conseguir las pruebas adecuadas para validar los Contenedores.*
fr: Pour le moment ceci n'a pas de core in "src", mais a un certain nombre de codes de wrappers SQL et de codes de topologie dans le répertoire "sql". *Les wrappers spécifiques d'algorithmes devraient être déplacées à l'arbre d'algorithme et les tests appropriés devraient être ajoutés pour valider les wrappers.*

source: core/dijkstra/
es: src/dijkstra/

source: This is an implementation of Dikjstra's shortest path solution using Boost Graph libraries for the implementation.
es: Esto es una implementación de la solución de ruta más corta de Dikjstra usando las bibliotecas de gráficas Boost para la aplicación.
fr: Ceci est une implémentation de la solution du plus court chemin Dikjstra utilisant les bibliothèques Boost Graph pour l'implémentation.

source: core/driving_distance/
es: src/driving_distance/

source: This optional package creates driving distance polygons based on solving a Dijkstra shortest path solution, then creating polygons based on equal cost distances from the start point. This optional package requires CGAL libraries to be installed.
es: Este paquete opcional crea polígonos de distancia de manejo basados en la solución de la ruta más corta de Dijkstra, luego crea polígonos basados en las distancias de igual costo desde el punto de inicial. Este paquete opcional requiere que las bibliotecas CGAL estén instaladas.
fr: Ce paquet optionnel créée des polygones de driving distance basées sur la résolution de la solution du plus court chemin Dijkstra, ensuite en créant des polygones basés sur les distances de coût égal depuis le point de départ. Ce paquet optionnel requiert d'avoir installé les librairies CGAL.

source: core/shooting_star/
es: src/shooting_star/

source: *DEPRECATED and DOES NOT WORK and IS BEING REMOVED* This is an edge based shortest path algorithm that supports turn restrictions. It is based on Boost Graph. Do *NOT* use this algorithm as it is broken, instead use *trsp* which has the same functionality and is faster and give correct results.
es: *OBSOLETO y NO FUNCIONA y está SIENDO ELIMINADO* este es un algoritmo basado algoritmo del camino más corto que soporta restricciones de giro. Se basa en las bibliotecas de gráficas Boost. *NO* usar este algoritmo ya que está roto, en su lugar usar *trsp* que tiene la misma funcionalidad, es más rápido y da resultados correctos.
fr: *DESAPPROUVE et NE FONCTIONNE PAS et SUR LE POINT D'ETRE SUPPRIME* Ceci est une arête basée sur l'algorithme du plus court chemin qui supporte les restrictions de virage. It is based on Boost Graph. Ne *PAS* utiliser cet algorithme comme il est cassé, utiliser *trsp* à la place, qui a la même fonctionnalité et est plus rapide et donne des résultats corrects.

source: core/trsp/
es: src/trsp/

source: This is a turn restricted shortest path algorithm. It has some nice features like you can specify the start and end points as a percentage along an edge. Restrictions are stored in a separate table from the graph edges and this make it easier to manage the data.
es: Este es un algoritmo de ruta más corto giro restringido. Tiene algunas características como: poder especificar los puntos iniciales y finales en forma de porcentaje a lo largo de un borde. Las restricciones se almacenan en una tabla separada de los bordes del gráfico, haciendo mas sencilla la administración de los datos.
fr: Ceci est un algorithme du plus court chemin avec restrictions de virage. Il a des caractéristiques sympathiques comme vous pouvez spécifiez les points de début et la fin comme un pourcentage d'une arête. Les restrictions sont sauvegardées dans une table séparée des arêtes du graphe et cela rend plus facile de gérer les données.

source: core/tsp/
es: src/tsp/

source: This optional package provides the ability to compute traveling salesman problem solutions and compute the resulting route. This optional package requires GAUL libaries to be installed.
es: Este paquete opcional proporciona la capacidad de calcular soluciones de problema del vendedor viajante y calcular la ruta resultante. Este paquete opcional requiere las que las bibliotecas GAUL se encuentren instaladas.
fr: Ce paquet optionnel fournit la capacité de calculer les solutions du problème du voyageur de commerce et calcule la route résultante. Ce paquet optionnel requiert l'installation des librairies GAUL.

source: Miscellaneous scripts and tools.
es: Varios scripts y herramientas.
fr: Scripts divers et outils.

source: This is the output directory where compiled libraries and installation targets are staged before installation.
es: Este es el directorio de salida donde se almacenan las bibliotecas compiladas y objetivos de la instalación antes de la instalación.
fr: Ceci est le répertoire de sortie où les cibles des bibliothèques compilées et des installations sont présentées avant l'installation.

source: Documentation Layout
es: Diseño de documentación
fr: Mise en page de la documentation

source: *As noted above all documentation should be done using reStructuredText formated files.*
es: *Como se señaló anteriormente, la documentación debe hacerse usando archivos con formato reStructuredText.*
fr: *Comme mentionné ci-dessus toute la documentation devrait être construite en utilisant les fichiers formattés reStructuredText.*

source: Documentation is distributed into the source tree. This top level "doc" directory is intended for high level documentation cover subjects like:
es: La documentación se distribuye en el árbol de las fuentes. Este directorio "doc" de nivel superior está destinado a las portada de los temas de documentación de nivel alto como:
fr: La documentation est distribuée dans l'arbre des sources. Ce répertoire "doc" de haut niveau est prévu pour la documentation de haut niveau couvrant les sujets comme :

source: Compiling and testing
es: Compilación y pruebas
fr: Compilation et tests

source: Installation
es: Instalación

source: Tutorials
es: Tutoriales
fr: Tutoriels

source: Users' Guide front materials
es: Materiales para guía de los usuarios
fr: Documentation liminaire du Guide Utilisateur

source: Reference Manual front materials
es: Materiales de manuales de referencia
fr: Documentation liminaire du Manuel de référence

source: Since the algorithm specific documentation is contained in the source tree with the algorithm specific files, the process of building the documentation and publishing it will need to assemble the details with the front material as needed.
es: Puesto que la documentación específica del algoritmo se contiene en el árbol de código fuente con los archivos específicos de algoritmo, el proceso de construcción de la documentación y publicación tendrá que ensamblar los detalles con el material según se necesite.
fr: Puisque la documentation spécifique de l'algorithme est contenue dans l'arbre de sources avec les fichiers spécifiques de l'algorithme, le processus de la construction de la documentation et la publication va avoir besoin d'assembler les détails avec la documentation de premier rang si besoin.

source: Also, to keep the "doc" directory from getting cluttered, each major book like those listed above, should be contained in a separate directory under "doc". Any images or other materials related to the book should also be kept in that directory.
es: También, para evitar que el directorio de "doc" se desordene, cada libro mayor, como los mencionados anteriormente, deberán estar incluidos en un directorio separado bajo el directorio "doc". Cualquier imágen u otros materiales relacionados con el libro, deberán mantenerse en ese directorio.
fr: Aussi, pour empêcher le répertoire "doc" d'être encombré, chaque libre majeur comme ceux listés ci-dessus, doivent être contenu dans un répertoire séparé dans "doc". Toutes les images ou autres documents liés au livre doivent être aussi mis dans ce répertoire.

source: Testing Infrastructure
es: Pruebas de infraestructura
fr: Infrastructure de test

source: There is a very basic testing infrastructure put in place. Here are the basics of how it works. We need more test cases. Longer term we should probably get someone to setup travis-ci or jenkins testing frameworks.
es: Se proporciona una infraestructura de prueba muy básica. Aquí están los fundamentos del cómo funciona. Necesitamos más casos de prueba. A más largo plazo que probablemente se tendrá un encargado de configurar marcos de pruebas travis-ci o jenkins .
fr: L'infrastructure de test mise en place est très basique. Voici les bases de comment ça marche. Nous avons besoin de plus de cas de tests. A long terme nous devrons probablement avoir une personne pour installer les frameworks travis-ci ou jenkins.

source: Here is the graph for the TRSP tests.
es: Aquí está el gráfico para las pruebas TRSP.
fr: Voici le graphe des tests TRSP.

source: Tests are run via the script at the top level tools/test-runner.pl and it runs all the test configured tests and at the moment just dumps the results structure of the test. This can be prettied up later.
es: Las pruebas se ejecutan mediante el script en el nivel superior tools/test-runner.pl y ejecuta todas la pruebas configuradas arrojando la estructura de resultados de la prueba. Esto puede ser mejorado en un futuro.
fr: Les tests sont lancés via le script au haut niveau tools/test-runner.pl qui exécute tous les tests configurés et pour le moment produit en résultats la structure de test. Cela peut être amélioré par la suite.

source: It also assumes that you have installed the libraries as it tests using the installed postgresql. This probably needs to be made smarter so we can test out of the build tree. I'll need to think about that.
es: También supone que se tienen instaladas las bibliotecas ya que hace uso del postgresql instalado. Probablemente esto necesita mejorarse para poner probar el árbol de la construcción. Pensar en eso.
fr: Cela suppose aussi que vous avez installé les librairies car les tests requièrent postgresql installé. Il est probablement nécessaire de rendre cela mieux conçu pour que nous puissions essayer l'arbre de build. Je vais essayer de réfléchir à ça.

source: Basically each .../test/ directory should include one *test.conf* file that is a perl script fragment that defines what data files to load and what tests to run. I have built in some mechanisms to allow test and data to be pg version and postgis version specific, but I'm not using that yet. So for example, *core/trsp/test/test-any-00.data* is a sql plain text dump that will load and needed data for a set of tests. This is also the graph in the image above. You can specify multiple files to load, but as a group they need to have unique names.
es: Básicamente, cada directorio .../test/ debe incluir un *test.conf* Archivo que es un fragmento de script de perl que define que archivos de datos cargar y las pruebas a ejecutar. Se ha desarrollado mecanismos para permitir que la prueba y los datos sean específicos para las versiones pg y PostGIS, pero no está habilitado todavía. Así que por ejemplo, *src/trsp/test/test-any-00.data* es un volcado dump de texto sin formato de sql que carga los datos necesarios para una serie de pruebas. Este es también el grafo en la imagen de arriba. Usted puede especificar varios archivos para cargar, pero como grupo hay la necesidad de tener nombres únicos.
fr: Simplement chaque répertoire .../test/ doit inclure un fichier *test.conf* qui est un fragment de script perl qui définit quels fichiers de données charger et quels tests lancer. J'ai intégré certains mécanismes pour autoriser tests et données d'être spécifiques aux version pg et postgis, mais je ne l'utilise pas encore. Ainsi par exemple, *core/trsp/test/test-any-00.data* est un texte plein généré qui va charger les données nécessaires pour un jeu de tests. C'est aussi le graphe dans l'image de dessus. Vous pouvez spécifier plusieurs fichiers à charger, mais comme un groupe ils ont besoin d'avoir des noms uniques.

source: core/trsp/test/test-any-00.test is a sql command to be run. It will get run as:
es: src/TRSP/test/test-any-00.test es un comando sql a ser ejecutado. Se ejecutará como:
fr: core/trsp/test/test-any-00.test est une commande sql qui peut être exécutée. Elle s'exécute ainsi :

source: Then if there is a difference then an test failure is reported.
es: Entonces si hay una diferencia se reporta el fracaso de la prueba.
fr: Ensuite si il y a une différence, alors un échec de test est reporté.
