Repository: stecyr/pgrouting
Catalog: doc/i18n/*/LC_MESSAGES/src/common/doc/types/cost_result.po
Languages: es

source: Name
es: Nombre

source: ``pgr_costResult[]`` — A set of records to describe a path result with cost attribute.
es: ``pgr_costResult[]`` — un conjunto de registros para describir un recorrido con el atributo de costo.

source: Description
es: Descripción

source: sequential ID indicating the path order
es: identificador secuencial, indicando el orden del recorrido

source: generic name, to be specified by the function, typically the node id
es: nombre genérico, a ser especificado por la función, típicamente el identificador del nodo

source: generic name, to be specified by the function, typically the edge id
es: nombre genérico, a ser especificado por la función, típicamente el identificador del borde

source: cost attribute
es: atributo de costo

source: pgr_costResult3[] - Multiple Path Results with Cost
es: pgr_costResult3[] - resultados múltiples de recorridos con costo

source: ``pgr_costResult3[]`` — A set of records to describe a path result with cost attribute.
es: ``pgr_costResult3[]`` — un conjunto de registros para describir varios resultados de recorridos con el atributo de costo.

source: generic name, to be specified by the function, typically the path id
es: nombre genérico, a ser especificado por la función, típicamente el identificador del recorrido

source: History
es: Historia

source: New in version 2.0.0
es: Nuevo en la versión 2.0.0

source: Replaces ``path_result``
es: Sustituye a ``path_result``

source: See Also
es: Véase también

source: :ref:`introduction`
es: :ref:`Introducción <introduction>`
