Repository: stecyr/pgrouting
Catalog: doc/i18n/*/LC_MESSAGES/doc/src/installation/build.po
Languages: es

source: Build Guide
es: Guía de Compilación

source: To be able to compile pgRouting make sure that the following dependencies are met:
es: Para poder compilar pgRouting asegúrese de que se cumplan las siguientes dependencias:

source: C and C++ compilers
es: Compiladores de C y C++

source: Postgresql version >= 8.4 (>= 9.1 recommended)
es: Postgresql versiones >= 8.4 (>= 9.1 recomendado)

source: PostGIS version >= 1.5 (>= 2.0 recommended)
es: PostGIS Versión> = 1.5 (> = 2.0 recomendado)

source: The Boost Graph Library (BGL). Version >= [TBD]
es: La biblioteca de gráficos de Boost (BGL). Versión > = [por determinarse]

source: (optional, for Driving Distance) CGAL >= [TBD]
es: (opcional, para la distancia de manejo) CGAL > = [por determinarse]

source: (optional, for Documentation) Sphinx >= 1.1
es: (opcional, para la documentación) Sphinx > = 1.1

source: (optional, for Documentation as PDF) Latex >= [TBD]
es: (opcional, para la documentación en formato PDF) Látex > = [TBD]

source: The cmake system has variables the can be configured via the command line options by setting them with -D<varable>=<value>. You can get a listing of these via:
es: El sistema cmake tiene variables la pueden configurarse mediante las opciones de línea de comandos con -D <varable>=<value>. Usted puede obtener un listado de estos mediante:

source: Currently these are:
es: Actualmente son:

source: Boost_DIR:PATH=Boost_DIR-NOTFOUND CMAKE_BUILD_TYPE:STRING= CMAKE_INSTALL_PREFIX:PATH=/usr/local POSTGRESQL_EXECUTABLE:FILEPATH=/usr/lib/postgresql/9.2/bin/postgres POSTGRESQL_PG_CONFIG:FILEPATH=/usr/bin/pg_config WITH_DD:BOOL=ON WITH_DOC:BOOL=OFF BUILD_HTML:BOOL=ON BUILD_LATEX:BOOL=OFF BUILD_MAN:BOOL=ON
es: Boost_DIR:Path = CMAKE_BUILD_TYPE:STRING Boost_DIR-NOTFOUND = CMAKE_INSTALL_PREFIX:PATH = / usr/local POSTGRESQL_EXECUTABLE:FILEPATH=/usr/lib/postgresql/9.2/bin/postgres POSTGRESQL_PG_CONFIG:FILEPATH = / usr/bin/pg_config WITH_DD:BOOL = ON WITH_DOC:BOOL = OFF BUILD_HTML:BOOL = ON BUILD_LATEX:BOOL = OFF BUILD_MAN:BOOL = ON

source: These also show the current or default values based on our development system. So your values my be different. In general the ones that are of most interest are:
es: Estos también muestran los valores por defecto basados en nuestro sistema de desarrollo. Así que algunos de sus valores pueden ser diferentes en su sistema. En general los que son de mayor interés son:

source: WITH_DD:BOOL=ON -- Turn on/off building driving distance code. WITH_DOC:BOOL=OFF -- Turn on/off building the documentation BUILD_HTML:BOOL=ON -- If WITH_DOC=ON, turn on/off building HTML BUILD_LATEX:BOOL=OFF -- If WITH_DOC=ON, turn on/off building PDF BUILD_MAN:BOOL=ON -- If WITH_DOC=ON, turn on/off building MAN pages
es: WITH_DD:bool = ON -- encender/apagar Distancia de Manejo. WITH_DOC:bool = OFF -- encender/apagar la documentación BUILD_HTML:BOOL = ON -- con WITH_DOC = ON, encender/apagar HTML BUILD_LATEX:BOOL = OFF -- con WITH_DOC = ON, encender/apagar PDF BUILD_MAN:BOOL = ON -- si WITH_DOC = ON, encender/apagar MAN

source: To change any of these add ``-D<variable>=<value>`` to the cmake lines below. For example to turn on documentation, your cmake command might look like:
es: Para cambiar cualquiera de estos añadir ``-D<variable>=<value>`` a las líneas de cmake. Por ejemplo activar la documentación, el comando cmake:

source: If you turn on the documentation, you also need to add the ``doc`` target to the make command.
es: Si enciende la documentación, también tienes que añadir el objetivo ``doc`` al comando "make"

source: For MinGW on Windows
es: Para MinGW en Windows

source: For Linux
es: Para Linux

source: With Documentation
es: Con la documentación

source: Build with documentation (requires `Sphinx <http://sphinx-doc.org/>`_):
es: Construir con documentación (requiere `Sphinx <http://sphinx-doc.org/>`_):

source: Rebuild modified documentation only:
es: Reconstrucción de la documentación modificada solamente:
